---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelCurveNode
source: html/adc2557d-1981-edc5-7f75-b001c559e747.htm
---
# ModelCurveNode Members

Specifies whether the .NET object represents a valid Revit entity.